incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "${FOAM_CASE}/system/include/caseDefinition"

// calculate k value at inlet
kref            #eval{ 1.5*sqr($UinfMag*$Tu) };

dimensions      [ 0 2 -2 0 0 0 0 ];
internalField   uniform $kref;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    $inletPatch		//Inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    $outletPatch		//Outlet
    {
        type            zeroGradient;
    }
    Plinth
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    $rotatingWallPatches
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    $movingMeshWallPatches
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    $movingGroundWallPatches
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    $symmPatches
    {
        type            symmetry;
    }
}

// ************************************************************************* //
