incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "${FOAM_CASE}/system/include/caseDefinition"

dimensions      [ 0 2 -2 0 0 0 0 ];
internalField   uniform $pref;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    $inletPatch
    {
        type            zeroGradient;
    }

    $outletPatch
    {
        type            uniformFixedValue;
        uniformValue    constant $pref;
        value           $internalField;
    }
    Plinth
    {
        type            zeroGradient;
    }
    $rotatingWallPatches
    {
        type            zeroGradient;
    }
    $movingMeshWallPatches
    {
        type            zeroGradient;
    }
    $movingGroundWallPatches
    {
        type            zeroGradient;
    }
    $symmPatches
    {
        type            symmetry;
    }

}

// ************************************************************************* //
