incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include       "${FOAM_CASE}/system/include/caseDefinition"

simulationType LES;

LES
{
    LESModel        $LESturbModel;
    delta           $deltaTurb;
    
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
