incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/CourantNo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

CourantNo
{
    type            CourantNo;
    libs            ("libfieldFunctionObjects.so");
    log             true;
    enabled         true;
    writeControl    writeTime;
}

// ************************************************************************* //
