incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly false;


// Baffles to create.
baffles
{
    // NOTE: cyclicAMI patches MUST BE defined PRIOR to their associted
    //       blockage patches

    ACMI1 
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    IstatZone;

        patches
        {
            master
            {
                //- Master side patch
                name            ACMI1_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ACMI2_couple;
                nonOverlapPatch ACMI1_blockage;
                transform       noOrdering;
            }

            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI1_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ACMI1_blockage;
                type            symmetry;
            }

            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI1_blockage;
                type            symmetry;
            }

        }
    }
    ACMI2
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    IrotaZone;

        patches
        {
            master
            {
                //- Master side patch
                name            ACMI2_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ACMI1_couple;
                nonOverlapPatch ACMI2_blockage;
                transform       noOrdering;
            }

            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI2_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ACMI2_blockage;
                type            symmetry;
            }

            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI2_blockage;
                type            symmetry;
            }

        }
    }
    ACMI3
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    OstatZone;

        patches
        {
            master
            {
                //- Master side patch
                name            ACMI3_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ACMI4_couple;
                nonOverlapPatch ACMI3_blockage;
                transform       noOrdering;
            }

            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI3_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ACMI3_blockage;
                type            symmetry;
            }

            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI3_blockage;
                type            symmetry;
            }

        }
    }
    ACMI4
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    OrotaZone;

        patches
        {
            master
            {
                //- Master side patch
                name            ACMI4_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ACMI3_couple;
                nonOverlapPatch ACMI4_blockage;
                transform       noOrdering;
            }

            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI4_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ACMI4_blockage;
                type            symmetry;
            }

            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI4_blockage;
                type            symmetry;
            }

        }
    }

}


// ************************************************************************* //
