incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/fieldAverage
fieldAverage
{
    // Type of functionObject
    type fieldAverage;

    // Where to load it from (if not already in solver)
    libs ("libfieldFunctionObjects.so");

    writeControl    writeTime;
    enabled         true;
    // cleanRestart    false; //true;
    // Fields to be  averaged - runTime modifiable
    fields
    (
        U
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        p
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        nut
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
    );
}
