incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/fieldMinMax
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

minMax_U
{
    type            fieldMinMax;
    libs            ("libfieldFunctionObjects.so");
    fields          (U);
    log             false;
}

minMax_p
{
    type            fieldMinMax;
    libs            ("libfieldFunctionObjects.so");
    fields          (p);
    log             false;
}

// ************************************************************************* //
