incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-08;
        relTol          0;
    }

    "p|pcorr"
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.05;

        smoother        GaussSeidel;


        nCellsInCoarsestLevel 50;
    }

    "pFinal|pcorrFinal"
    {
        $p;
        relTol          0;

        // Explicit specify solver for coarse-level correction to override
        // solution tolerance
        coarsestLevelCorr
        {
            // For limited residual reduction (relTol) PPCR behaves better
            // than PCG (or PPCG)
            solver          PCG;
            preconditioner  DIC;
            relTol          0.05;
        }
    }

    "(U.*|k.*|omega.*|epsilon.*|nuTilda.*)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
    }
    Phi
    {
        $p;
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors   10;
}

PIMPLE
{
    nOuterCorrectors           8;      // max. no. iterations per time step
    nCorrectors                1;
    nNonOrthogonalCorrectors   0;
}

relaxationFactors
{
    fields
    {
        "p.*"                0.4;
    }
    equations
    {
        "U.*"                0.7;
        "(k.*|omega.*|epsilon.*|nuTilda.*)"     0.7;
    }
}


cache
{
    grad(U);
}


// ************************************************************************* //
