incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/include/caseDefinition
// Geometric parameters
lref       2.78618;                        // Reference length/wheelbase (in m)
Aref       2.17;                           // Reference area (in m^2) - frontal area

// Patch assignment:
rotatingWallPatches         "(WALL_Brakedisc_rotating|WALL_Rim_rotating|WALL_Tire_rotating)";
movingMeshWallPatches       "(WALL_Rim_Brakedisc_fixed)";
movingGroundWallPatches     "(ground|ground_layer)";
inletPatch                  inlet;
outletPatch                 outlet;
symmPatches                 "(freestream)";

// Inlet and boundary conditions:
Uinf                (38.889 0 0);    // Reference velocity vector at inlet (in m/s)
UinfMag             38.889;          // Reference velocity magnitude at inlet (in m/s)
nu                  1.507e-05;       // Reference kinematic viscosity (in m^2/s) - air at 20°C
pref                0.0;             // Reference pressure at outlet (in m^2/s^2)
viscRatio           5.0;             // Turbulent viscosity ratio in domain
Tu                  0.0026;          // Turbulence intensity in domain

// Turbulence model:
LESturbModel        kOmegaSSTDDES;   // Model for LES if used
RASturbModel        kOmegaSST;       // Model for RANS simulations if used
deltaTurb           maxDeltaxyz;     // Selected delta formulation

