incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/solverInfo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

solverInfo
{
    type                solverInfo;
    libs                ("libutilityFunctionObjects.so");
    fields              (U p k omega epsilon nuTilda);
    writeControl        timeStep;
    writeInterval       1;
    writeResidualFields no;
}

// ************************************************************************* //
