incompressible/pimpleFoam/LES/wheelRotMesh/wheelRotMesh.orig/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    IstatFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch    AMI_inner_stat;
        }
    }
    {
        name    IstatZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet IstatFaceSet;
        }
    }

    {
        name    IrotaFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch    AMI_inner_rota;
        }
    }

    {
        name    IrotaZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet IrotaFaceSet;
        }
    }
    {
        name    OstatFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch    AMI_outer_stat;
        }
    }
    {
        name    OstatZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet OstatFaceSet;
        }
    }

    {
        name    OrotaFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch    AMI_outer_rota;
        }
    }

    {
        name    OrotaZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet OrotaFaceSet;
        }
    }

);

// ************************************************************************* //
